{
  "source": "meteo.gov.lk",
  "lang": "multi",
  "fetched_at": "2026-01-11T06:21:05.030976+05:30",
  "si": {
    "title": "2026 ජනවාරි මස 11 දින සඳහා කාලගුණ අනාවැකිය 2026 ජනවාරි මස 11 දින උදෑසන 05.30 ට නිකුත්කරන ලදි. මන්නාරම් බොක්ක ප්‍රදේශයේ පැවතින අඩු පීඩන ප්‍රදේශය තවදුරටත් දුර්වල වෙමින් පවතී. මේ හේතුවෙන් මෙම පද්ධතිය මගින් දිවයිනේ කාලගුණයට වන බලපෑම තවදුරටත් අඩු වෙමින් පවතී. උතුරු , උතුරු-මැද, ඌව සහ නැගෙනහිර පළාත්වල වැසි වාර කිහිපයක් ඇතිවේ. වයඹ සහ මධ්‍යම පළාත්වල වැසි ස්වල්පයක් ඇතිවිය හැක. සෙසු ප්‍රදේශවල සවස් කාලයේ හෝ රාත්‍රී කාලයේදී ස්ථාන ස්වල්පයක වැසි හෝ ගිගුරුම් සහිත වැසි ඇති විය හැක. බස්නාහිර, සබරගමුව සහ මධ්‍යම පළාත්වලත් ගාල්ල සහ මාතර දිස්ත්‍රික්කවලත් ඇතැම් ස්ථානවල අළුයම් කාලයේදී මීදුම් සහිත තත්ත්වයක් පැවතිය හැක. ගිගුරුම් සහිත වැසි සමග ඇතිවිය හැකි තාවකාලික තද සුළං වලින් සහ අකුණු මඟින් සිදු වන අනතුරු අවම කර ගැනීමට අවශ්‍ය පියවර ගන්නා ලෙස ජනතාවගෙන් කාරුණිකව ඉල්ලා සිටිනු ලැබේ.",
    "issued": "",
    "body": ""
  },
  "en": {
    "title": "WEATHER FORECAST FOR 11 JANUARY 2026 Issued at 05.30 a.m. on 11 January 2026 The low pressure area over the Gulf of Mannar is weakening further. Therefore, the influence of this system on the island's weather is further gradually reducing. Several spells of showers will occur in Northern, North-central, Uva, and Eastern provinces. A few showers may occur in the North-western and Central provinces. Showers or thundershowers may occur at a few places elsewhere during evening or night. Misty conditions can be expected at some places in Western, Sabaragamuwa and Central provinces and in Galle and Matara districts during the early hours of the morning. The general public is kindly requested to take adequate precautions to minimize damages caused by temporary localized strong winds and lightning during thundershowers.",
    "issued": "",
    "body": "Severe Advisory\n\nPublic Weather\n\nFleet/Shipping\n\nSea Weather\n\nCity Forecast\n\nWeb GIS\n\nPRISM\n\nWeather Graphics\n\n3 Hourly Data\n\n15 Day Forecast\n\nAgromet / Weather Data\n\nSeasonal Forecast\n\nAstronomical Data\n\nPublic Notices\n\nAbout Us\n\nContact Us\n\nOnline Users : 541\n\nTsunami Warning – No Advisory\n\nLand Area Advisory PDF\n\nLightning Advisory – No Advisory\n\nSea Area Advisory PDF\n\nHeat Advisory – No Advisory\n\n🎙️Listen To The Weather Forecast"
  }
}