{
  "source": "meteo.gov.lk",
  "lang": "multi",
  "fetched_at": "2026-02-07T06:23:41.553932+05:30",
  "si": {
    "title": "2026 පෙබරවාරි මස 07 දින සඳහා කාලගුණ අනාවැකිය 2026 පෙබරවාරි මස 07 දින උදෑසන 05.30 ට නිකුත්කරන ලදි. ඌව පළාතේත් මාතලේ, නුවරඑලිය, අම්පාර සහ මඩකලපුව දිස්ත්‍රික්කවලත් විටින් විට වැසි ඇතිවේ. උතුරු, උතුරු-මැද සහ වයඹ පළාත්වල සහ හම්බන්තොට දිස්ත්‍රික්කයේ වැසි වාර කිහිපයක් ඇති වේ. සෙසු ප්‍රදේශවල ප. ව 2.00 න් පසු තැනින් තැන වැසි හෝ ගිගුරුම් සහිත වැසි ඇති විය හැකි අතර ඇතැම් ස්ථානවලට මිලිමීටර් 50 ට වැඩි තරමක් තද වැසි ඇති විය හැක. මධ්‍යම කඳුකරයේ නැගෙනහිර බෑවුම් ප්‍රදේශවලත් උතුරු, උතුරු-මැද සහ වයඹ පළාත්වලත් මාතලේ, ත්‍රිකුණාමලය සහ හම්බන්තොට දිස්ත්‍රික්කවලත් විටින් විට හමන පැ.කි.මී. (30-40) දක්වා වන තරමක් තද සුළං ඇතිවිය හැක. බස්නාහිර, සබරගමුව සහ මධ්‍යම පළාත්වලත් ගාල්ල, මාතර සහ බදුල්ල දිස්ත්‍රික්කවලත් ඇතැම් ස්ථානවල අළුයම් කාලයේදී මීදුම් සහිත තත්ත්වයක් පැවතිය හැක. ගිගුරුම් සහිත වැසි සමග ඇතිවිය හැකි තාවකාලික තද සුළං වලින් සහ අකුණු මඟින් සිදු වන අනතුරු අවම කර ගැනීමට අවශ්‍ය පියවර ගන්නා ලෙස ජනතාවගෙන් කාරුණිකව ඉල්ලා සිටිනු ලැබේ.",
    "issued": "",
    "body": ""
  },
  "en": {
    "title": "WEATHER FORECAST FOR 07 FEBRUARY 2026 Issued at 05.30 a.m. on 07 February 2026 Showers will occur at times in Uva province and in Matale, Nuwara-Eliya, Ampara and Batticaloa districts. Several spells of showers will occur at Northern, North-central and North-western provinces and in Hambantota district. Showers or thundershowers may occur at several places elsewhere after 2.00 p.m. Fairly heavy showers above 50 mm are likely at some places. Fairly strong winds about (30-40) kmph can be expected at times over Eastern slopes of the central hills, Northern, North-central and North-western provinces and in Matale, Trincomalee and Hambantota districts. Misty conditions can be expected at some places in Western, Sabaragamuwa and Central provinces and in Galle, Matara and Badulla districts during the early hours of the morning. The general public is kindly requested to take adequate precautions to minimize damages caused by temporary localized strong winds and lightning during thundershowers.",
    "issued": "",
    "body": "Severe Advisory\n\nPublic Weather\n\nMarine\n\nPRISM\n\nWeather Graphics\n\n3 Hourly Data\n\nAgromet / Weather Data\n\nSeasonal Forecast\n\nAstronomical Data\n\nPublications\n\nPublic Notices\n\nAbout Us\n\nContact Us\n\nOnline Users : 419\n\nTsunami Warning – No Advisory\n\nLand Area Advisory – No Advisory\n\nLightning Advisory PDF\n\nSea Area Advisory – No Advisory\n\nHeat Advisory – No Advisory\n\n🎙️Listen To The Weather Forecast"
  }
}