{
  "source": "meteo.gov.lk",
  "lang": "multi",
  "fetched_at": "2026-01-31T06:21:46.351584+05:30",
  "si": {
    "title": "2026 ජනවාරි මස 31 දින සඳහා කාලගුණ අනාවැකිය 2026 ජනවාරි මස 31 දින උදෑසන 05.30 ට නිකුත්කරන ලදි. උතුරු, උතුරු-මැද, නැගෙනහිර සහ මධ්‍යම පළාත්වල විටින් විට වැසි ඇතිවේ. මුලතිවු, ත්‍රිකුණාමලය පොළොන්නාරුව සහ මාතලේ දිස්ත්‍රික්කවලත් ඇතැම් ස්ථානවලට මි.මී. 50 ට වැඩි තරමක තද වැසි ඇති විය හැක. ඌව සහ වයඹ පළාත්වල වැසි වාර කිහිපයක් ඇතිවේ. දිවයිනේ සෙසු ප්‍රදේශවල පස්වරු 2.00 න් පසුව තැනින් තැන වැසි හෝ ගිගුරුම් සහිත වැසි ඇතිවිය හැකි අතර ඇතැම් ස්ථානවලට මි.මී. 50 ට වැඩි තරමක තද වැසි ඇති විය හැක. බස්නාහිර සහ සබරගමුව පළාත්වලත් ගාල්ල සහ මාතර දිස්ත්‍රික්කවලත් ඇතැම් ස්ථානවල අළුයම් කාලයේදී මීදුම් සහිත තත්ත්වයක් පැවතිය හැක. ගිගුරුම් සහිත වැසි සමග ඇතිවිය හැකි තාවකාලික තද සුළං වලින් සහ අකුණු මඟින් සිදු වන අනතුරු අවම කර ගැනීමට අවශ්‍ය පියවර ගන්නා ලෙස ජනතාවගෙන් කාරුණිකව ඉල්ලා සිටිනු ලැබේ.",
    "issued": "",
    "body": ""
  },
  "en": {
    "title": "WEATHER FORECAST FOR 31 JANUARY 2026 Issued at 05.30 a.m. on 31 January 2026 Showers will occur at times in Northern, North-Central, Eastern and Central provinces. Fairly heavy falls above 50 mm are likely at some places in Mullaittivu, Trincomalee, Polonnaruwa and Matale districts. Several spells of shower will occur in Uva and North-western provinces. Showers or thundershowers are likely at several places in other areas of the island after 2.00 p.m, and fairly heavy falls above 50 mm are likely at some places. Misty conditions can be expected at some places in Western and Sabaragamuwa provinces and in Galle and Matara districts during the early hours of the morning. The general public is kindly requested to take adequate precautions to minimize damages caused by temporary localized strong winds and lightning during thundershowers.",
    "issued": "",
    "body": "Severe Advisory\n\nPublic Weather\n\nFleet/Shipping\n\nSea Weather\n\nCity Forecast\n\nWeb GIS\n\nPRISM\n\nWeather Graphics\n\n3 Hourly Data\n\n15 Day Forecast\n\nAgromet / Weather Data\n\nSeasonal Forecast\n\nAstronomical Data\n\nPublications\n\nPublic Notices\n\nAbout Us\n\nContact Us\n\nOnline Users : 139"
  }
}