{
  "source": "meteo.gov.lk",
  "lang": "multi",
  "fetched_at": "2026-01-13T06:11:07.022812+05:30",
  "si": {
    "title": "2026 ජනවාරි මස 13 දින සඳහා කාලගුණ අනාවැකිය 2026 ජනවාරි මස 13 දින උදෑසන 05.30 ට නිකුත්කරන ලදි. උතුරු , උතුරු-මැද, ඌව, නැගෙනහිර සහ මධ්‍යම පළාත්වල වැසි වාර කිහිපයක් ඇති වේ. බස්නාහිර, සබරගමුව සහ වයඹ පළාත්වලත් ගාල්ල සහ මාතර දිස්ත්‍රික්කවලත් ප. ව 1.00 න් පසු තැනින් තැන වැසි හෝ ගිගුරුම් සහිත වැසි ඇති විය හැක. මෙම ප්‍රදේශවල ඇතැම් ස්ථාන වල මිලිමීටර් 50 ට වැඩි තරමක් තද වැසි ඇති විය හැක. බස්නාහිර, සබරගමුව, මධ්‍යම සහ ඌව පළාත්වලත් ගාල්ල, මාතර සහ කුරුණෑගල දිස්ත්‍රික්කවලත් ඇතැම් ස්ථානවල අළුයම් කාලයේදී මීදුම් සහිත තත්ත්වයක් පැවතිය හැක. ගිගුරුම් සහිත වැසි සමග ඇතිවිය හැකි තාවකාලික තද සුළං වලින් සහ අකුණු මඟින් සිදු වන අනතුරු අවම කර ගැනීමට අවශ්‍ය පියවර ගන්නා ලෙස ජනතාවගෙන් කාරුණිකව ඉල්ලා සිටිනු ලැබේ.",
    "issued": "",
    "body": ""
  },
  "en": {
    "title": "WEATHER FORECAST FOR 13 JANUARY 2026 Issued at 05.30 a.m. on 13 January 2026 Several spells of showers will occur in Northern, North-central, Uva, Eastern and Central provinces. Showers or thundershowers may occur at several places in Western, Sabaragamuwa and North-western provinces and in Galle and Matara districts after 1.00 pm. Fairly heavy showers above 50 mm are likely at some places. Misty conditions can be expected at some places in Western, Sabaragamuwa, Central and Uva provinces and in Galle, Matara and Kurunegala districts during the early hours of the morning. The general public is kindly requested to take adequate precautions to minimize damages caused by temporary localized strong winds and lightning during thundershowers.",
    "issued": "",
    "body": "Severe Advisory\n\nPublic Weather\n\nFleet/Shipping\n\nSea Weather\n\nCity Forecast\n\nWeb GIS\n\nPRISM\n\nWeather Graphics\n\n3 Hourly Data\n\n15 Day Forecast\n\nAgromet / Weather Data\n\nSeasonal Forecast\n\nAstronomical Data\n\nPublic Notices\n\nAbout Us\n\nContact Us\n\nOnline Users : 316\n\nTsunami Warning – No Advisory\n\nLand Area Advisory – No Advisory\n\nLightning Advisory PDF\n\nSea Area Advisory – No Advisory\n\nHeat Advisory – No Advisory\n\n🎙️Listen To The Weather Forecast"
  }
}