{
  "source": "meteo.gov.lk",
  "lang": "multi",
  "fetched_at": "2026-01-12T06:18:22.954394+05:30",
  "si": {
    "title": "2026 ජනවාරි මස 12 දින සඳහා කාලගුණ අනාවැකිය 2026 ජනවාරි මස 12 දින උදෑසන 05.30 ට නිකුත්කරන ලදි. උතුරු , උතුරු-මැද, ඌව, නැගෙනහිර සහ මධ්‍යම පළාත්වලත් හම්බන්තොට දිස්ත්‍රික්කයේත් විටින් විට වැසි හෝ ගිගුරුම් සහිත වැසි ඇතිවේ. නැගෙනහිර සහ ඌව පළාත්වල ඇතැම් ස්ථානවලට මිලිමීටර් 50 ට වැඩි තරමක් තද වැසි ඇති විය හැක. සෙසු ප්‍රදේශවල ප. ව 1.00 න් පසු තැනින් තැන වැසි හෝ ගිගුරුම් සහිත වැසි ඇති විය හැක. වයඹ, බස්නාහිර සහ සබරගමුව පළාත්වල ඇතැම් ස්ථානවලට මිලිමීටර් 75 ක පමණ තරමක් තද වැසි ඇති විය හැක. බස්නාහිර, සබරගමුව සහ මධ්‍යම පළාත්වලත් ගාල්ල, මාතර සහ කුරුණෑගල දිස්ත්‍රික්කවලත් ඇතැම් ස්ථානවල අළුයම් කාලයේදී මීදුම් සහිත තත්ත්වයක් පැවතිය හැක. ගිගුරුම් සහිත වැසි සමග ඇතිවිය හැකි තාවකාලික තද සුළං වලින් සහ අකුණු මඟින් සිදු වන අනතුරු අවම කර ගැනීමට අවශ්‍ය පියවර ගන්නා ලෙස ජනතාවගෙන් කාරුණිකව ඉල්ලා සිටිනු ලැබේ.",
    "issued": "",
    "body": ""
  },
  "en": {
    "title": "WEATHER FORECAST FOR 12 JANUARY 2026 Issued at 05.30 a.m. on 12 January 2026 Showers or thundershowers will occur at times in Northern, North-central, Uva, Eastern and Central provinces and Hambantota district. Fairly heavy showers above 50 mm are likely at some places in Eastern and Uva provinces. Showers or thundershowers may occur at several places elsewhere after 1.00 pm. Fairly heavy showers about 75 mm are likely at some places in Northwestern, Western and Sabaragamuwa provinces. Misty conditions can be expected at some places in Western, Sabaragamuwa and Central provinces and in Galle, Matara and Kurunegala districts during the early hours of the morning. The general public is kindly requested to take adequate precautions to minimize damages caused by temporary localized strong winds and lightning during thundershowers.",
    "issued": "",
    "body": "Severe Advisory\n\nPublic Weather\n\nFleet/Shipping\n\nSea Weather\n\nCity Forecast\n\nWeb GIS\n\nPRISM\n\nWeather Graphics\n\n3 Hourly Data\n\n15 Day Forecast\n\nAgromet / Weather Data\n\nSeasonal Forecast\n\nAstronomical Data\n\nPublic Notices\n\nAbout Us\n\nContact Us\n\nOnline Users : 523"
  }
}