{
  "source": "meteo.gov.lk",
  "lang": "multi",
  "fetched_at": "2026-02-02T06:28:05.849109+05:30",
  "si": {
    "title": "2026 පෙබරවාරි මස 02 දින සඳහා කාලගුණ අනාවැකිය 2026 පෙබරවාරි මස 02 දින උදෑසන 05.30 ට නිකුත්කරන ලදි. උතුරු, උතුරු-මැද, නැගෙනහිර, ඌව සහ මධ්‍යම පළාත්වලත් හම්බන්තොට දිස්ත්‍රික්කයේත් වැසි වාර කිහිපයක් ඇතිවේ. බස්නාහිර සහ සබරගමුව පළාත්වලත් ගාල්ල සහ මාතර දිස්ත්‍රික්කවලත් පස්වරු 2.00 න් පසුව තැනින් තැන වැසි හෝ ගිගුරුම් සහිත වැසි ඇතිවිය හැකි අතර ඇතැම් ස්ථානවලට මි.මී. 50 ක පමණ තරමක තද වැසි ඇති විය හැක. බස්නාහිර, සබරගමුව සහ මධ්‍යම පළාත්වලත් ගාල්ල සහ මාතර දිස්ත්‍රික්කවලත් ඇතැම් ස්ථානවල අළුයම් කාලයේදී මීදුම් සහිත තත්ත්වයක් පැවතිය හැක. ගිගුරුම් සහිත වැසි සමග ඇතිවිය හැකි තාවකාලික තද සුළං වලින් සහ අකුණු මඟින් සිදු වන අනතුරු අවම කර ගැනීමට අවශ්‍ය පියවර ගන්නා ලෙස ජනතාවගෙන් කාරුණිකව ඉල්ලා සිටිනු ලැබේ.",
    "issued": "",
    "body": ""
  },
  "en": {
    "title": "WEATHER FORECAST FOR 02 FEBRUARY2026 Issued at 05.30 a.m. on 02 February 2026 Several spells of shower will occur in Northern, North-central, Eastern, Uva and Central provinces and in Hambanthota district. Showers or thundershowers are likely at several places in Western and Sabaragamuwa provinces and in Galle and Matara districts after 2.00 p.m. Fairly heavy falls about 50 mm are likely at some places. Misty conditions can be expected at some places in Western, Sabaragamuwa and Central provinces and in Galle and Matara districts during the early hours of the morning. The general public is kindly requested to take adequate precautions to minimize damages caused by temporary localized strong winds and lightning during thundershowers.",
    "issued": "",
    "body": "Severe Advisory\n\nPublic Weather\n\nFleet/Shipping\n\nSea Weather\n\nCity Forecast\n\nWeb GIS\n\nPRISM\n\nWeather Graphics\n\n3 Hourly Data\n\n15 Day Forecast\n\nAgromet / Weather Data\n\nSeasonal Forecast\n\nAstronomical Data\n\nPublications\n\nPublic Notices\n\nAbout Us\n\nContact Us\n\nOnline Users : 102\n\nTsunami Warning – No Advisory\n\nLand Area Advisory PDF\n\nLightning Advisory – No Advisory\n\nSea Area Advisory – No Advisory\n\nHeat Advisory – No Advisory\n\n🎙️Listen To The Weather Forecast"
  }
}