{
  "source": "meteo.gov.lk",
  "lang": "multi",
  "fetched_at": "2026-02-06T06:23:42.679487+05:30",
  "si": {
    "title": "2026 පෙබරවාරි මස 06 දින සඳහා කාලගුණ අනාවැකිය 2026 පෙබරවාරි මස 06 දින උදෑසන 05.30 ට නිකුත්කරන ලදි. නැගෙනහිර, ඌව සහ මධ්‍යම පළාත්වලත් පොලොන්නරුව සහ හම්බන්තොට දිස්ත්‍රික්කවලත් විටින් විට වැසි ඇතිවේ. ඌව සහ නැගෙනහිර පළාත්වලත් හම්බන්තොට, මාතලේ සහ නුවරඑලිය දිස්ත්‍රික්කවලත් ඇතැම් ස්ථානවලට මිලිමීටර් 50 ට වැඩි තරමක් තද වැසි ඇති විය හැක. උතුරු පළාතේත් අනුරාධපුර දිස්ත්‍රික්කයේත් වැසි වාර කිහිපයක් ඇති වේ. සෙසු ප්‍රදේශවල ප. ව 2.00 න් පසු තැනින් තැන වැසි හෝ ගිගුරුම් සහිත වැසි ඇති විය හැකි අතර රත්නපුර, කළුතර, ගාල්ල සහ මාතර දිස්ත්‍රික්කවල ඇතැම් ස්ථානවලට මිලිමීටර් 50 ට වැඩි තරමක් තද වැසි ඇති විය හැක. උතුරු සහ වයඹ පළාත්වලත් මාතලේ, ත්‍රිකුණාමලය සහ අනුරාධපුර දිස්ත්‍රික්කවලත් විටින් විට හමන පැ.කි.මී. (30-40) දක්වා වන තරමක් තද සුළං ඇතිවිය හැක. බස්නාහිර, සබරගමුව සහ මධ්‍යම පළාත්වලත් ගාල්ල, මාතර සහ බදුල්ල දිස්ත්‍රික්කවලත් ඇතැම් ස්ථානවල අළුයම් කාලයේදී මීදුම් සහිත තත්ත්වයක් පැවතිය හැක. ගිගුරුම් සහිත වැසි සමග ඇතිවිය හැකි තාවකාලික තද සුළං වලින් සහ අකුණු මඟින් සිදු වන අනතුරු අවම කර ගැනීමට අවශ්‍ය පියවර ගන්නා ලෙස ජනතාවගෙන් කාරුණිකව ඉල්ලා සිටිනු ලැබේ.",
    "issued": "",
    "body": ""
  },
  "en": {
    "title": "WEATHER FORECAST FOR 06 FEBRUARY 2026 Issued at 05.30 a.m. on 06 February 2026 Showers will occur at times in Eastern, Uva and Central provinces and in Polonnaruwa and Hambantota districts. Fairly heavy showers above 50 mm are likely at some places in Uva and Eastern provinces and in Hambantota, Matale and Nuwara-Eliya districts. Several spells of showers will occur at Northern province and in Anuradhapura district. Showers or thundershowers may occur at several places elsewhere after 2.00 p.m. Fairly heavy showers above 50 mm are likely at some places in Rathnapura, Kaluthara, Galle and Matara districts. Fairly strong winds about (30-40) kmph can be expected at times over Northern and North-western provinces and in Matale, Trincomalee and Anuradhapura districts. Misty conditions can be expected at some places in Western, Sabaragamuwa and Central provinces and in Galle, Matara and Badulla districts during the early hours of the morning. The general public is kindly requested to take adequate precautions to minimize damages caused by temporary localized strong winds and lightning during thundershowers.",
    "issued": "",
    "body": "Severe Advisory\n\nPublic Weather\n\nFleet/Shipping\n\nSea Weather\n\nCity Forecast\n\nPRISM\n\nWeather Graphics\n\n3 Hourly Data\n\n15 Day Forecast\n\nAgromet / Weather Data\n\nSeasonal Forecast\n\nAstronomical Data\n\nPublications\n\nPublic Notices\n\nAbout Us\n\nContact Us\n\nOnline Users : 499\n\nTsunami Warning – No Advisory\n\nLand Area Advisory – No Advisory\n\nLightning Advisory PDF\n\nSea Area Advisory – No Advisory\n\nHeat Advisory – No Advisory\n\n🎙️Listen To The Weather Forecast"
  }
}